Repository: mozilla-l10n/mt-training-data
Catalog: ug/ug_pontoon.tmx
Source language: en_us
Languages: ug

source: Switch automatically based on screen brightness
ug: ئېكراننىڭ يورۇقلۇقىغا ئاساسەن ئاپتوماتىك ئالماشتۇرىدۇ

source: Switch Mode
ug: ھالەت ئالماشتۇرۇش

source: Switch to Desktop Site
ug: ئۈستەل يۈزى بېكەتكە ئالماشتۇر

source: Switch to Mobile Site
ug: كۆچمە بېكەتكە ئالماشتۇر

source: Switch Your Default Browser
ug: كۆڭۈلدىكى توركۆرگۈ قىلىپ تەڭشە

source: Sync and Save Data
ug: قەدەمداشلاپ سانلىق مەلۇماتنى ساقلا

source: Sync Connected
ug: قەدەمداش باغلاندى

source: Sync Disconnected
ug: قەدەمداش ئۈزۈلدى

source: Synced
ug: قەدەمداشلاندى

source: Synced History
ug: قەدەمداش تارىخ

source: Synced Tabs
ug: قەدەمداشلانغان بەتكۈچ

source: Sync is offline
ug: قەدەمداش تورسىز

source: Sync Now
ug: ھازىر قەدەمداشلا

source: Sync Settings
ug: قەدەمداش تەڭشەكلەر

source: Sync Tabs
ug: بەتكۈچ قەدەمداشلا

source: System Auto
ug: سىستېما ئاپتوماتىك

source: System Theme
ug: سىستېما ئۆرنىكى

source: Tab %1$@ of %2$@
ug: %1$@ / %2$@ بەتكۈچ

source: Tab Closed
ug: بەتكۈچ تاقالدى

source: Tab Groups
ug: بەتكۈچ گۇرۇپپىسى

source: Tab pickup
ug: بەتكۈچ قوبۇللايدۇ

source: Tab received
ug: بەتكۈچ تاپشۇرۇۋالدى

source: Tab received from %@
ug: بەتكۈچ %@ دىن تاپشۇرۇۋېلىندى

source: Tabs %1$@ to %2$@ of %3$@
ug: %1$@ - %2$@ / %3$@ بەتكۈچ

source: Tabs Closed: %d
ug: بەتكۈچ تاقالدى: %d

source: Tabs: %d
ug: بەتكۈچ: %d

source: Tab Sent
ug: بەتكۈچ يوللاندى

source: Tabs Tray
ug: بەتكۈچ تەخسە

source: Take your passwords everywhere
ug: ئېلىپ يۈرۈشكە ئەپلىك ئىم

source: Tap to begin
ug: بۇ يەرنى چېكىپ باشلاڭ

source: Thanks for Reporting!
ug: دوكلات قىلغانلىقىڭىزغا رەھمەت!

source: The address will be removed from all of your synced devices.
ug: ئادرېس قەدەمداشلانغان بارلىق ئۈسكۈنىلىرىڭىزدىن چىقىرىۋېتىلىدۇ.

source: The *adjusted rating* is based only on reviews we believe to be reliable.
ug: بۇ *تەڭشەلگەن باھا* پەقەت بىز ئىشەنچلىك دەپ قارىغان باھالارنىلا ئاساس قىلىدۇ.

source: The data is invalid
ug: سانلىق مەلۇمات ئىناۋەتسىز

source: The Last Hour
ug: ئاخىرقى سائەت

source: The link you are trying to share cannot be shared.
ug: سىز ئورتاقلاشماقچى بولغان ئۇلانمىنى ھەمبەھىرلەشكە بولمايدۇ.

source: Theme Picker
ug: ئۆرنەك تاللىغۇچ

source: The new Independent Voices collection.
ug: يېڭى مۇستەقىل ئاۋاز توپلىمى.

source: The new search engine will appear in the quick search bar.
ug: يېڭى ئىزدەش موتورى تېز ئىزدەش بالداقتا كۆرۈنىدۇ.

source: The owner of %@ has configured their website improperly. To protect your information from being stolen, Firefox has not connected to this website.
ug: %@ نىڭ باشقۇرۇغۇچىسى تور بېكەتنى توغرا سەپلىمىگەن. ئۇچۇرلىرىڭىزنىڭ ئوغرىلىنىپ كېتىشىدىن ساقلىنىش ئۈچۈن، Firefox بۇ تور بېكەتكە باغلانمىدى.

source: The owner of %@ hasn’t set it up properly and a secure connection can’t be created.
ug: %@ نىڭ ئىگىسى ئۇنى مۇۋاپىق تەڭشىمىگەن، بىخەتەر باغلىنىش قۇرغىلى بولمايدۇ.

source: The page could not be displayed in Reader View.
ug: بۇ بەتنى ئوقۇرمەن كۆرۈنۈشىدە كۆرسىتەلمىدى.

source: The passwords you save or sync to %@ will be listed here. All passwords you save are encrypted.
ug: سىز ساقلىغان ياكى %@ غا قەدەمداشلىغان ئىم بۇ يەردە كۆرسىتىلىدۇ. سىز ساقلىغان بارلىق ئىم مەخپىيلەشتۈرۈلگەن.

source: There are ${count} options matching ‘Clear Private Tabs’.
ug: «شەخسىي بەتكۈچنى تازىلا» غا ماس كېلىدىغان ${count} تاللانما بار.

source: There are ${count} options matching ‘Go to Copied Link’.
ug: «كۆچۈرۈلگەن ئۇلانمىغا يۆتكەل» گە ماس كېلىدىغان ${count} تاللانما بار.

source: There are ${count} options matching ‘New Private Search’.
ug: «يېڭىدىن شەخسىي ئىزدە» گە ماس كېلىدىغان ${count} تاللانما بار.

source: There are ${count} options matching ‘New Search’.
ug: «يېڭىدىن ئىزدە» گە ماس كېلىدىغان ${count} تاللانما بار.

source: There are no results matching your search.
ug: ئىزدىشىڭىزگە ماس كېلىدىغان ھېچقانداق نەتىجە يوق.

source: There was an error converting the page
ug: بەتنى ئايلاندۇرۇۋاتقاندا خاتالىق كۆرۈلدى

source: There was a problem accessing tabs from your other devices. Try again in a few moments.
ug: باشقا ئۈسكۈنىلىرىڭىزدىكى بەتكۈچلەرنى زىيارەت قىلىشتا مەسىلە كۆرۈلدى. سەل تۇرۇپ قايتا سىناڭ.

source: The search provider could not be added.
ug: ئىزدەش تەمىنلىگۈچىنى قوشقىلى بولمايدۇ.

source: These cookies follow you from site to site to gather data about what you do online. They are set by third parties such as advertisers and analytics companies.
ug: بۇ ساقلانمىلار تور بېكەتتىن تور بېكەتكە ئەگىشىپ تورغا چىقىپ نېمە ئىش قىلىدىغانلىقىڭىز ھەققىدە ئۇچۇر توپلايدۇ. ئۇلارنى ئېلان بەرگۈچىلەر ۋە تەھلىل شىركىتى قاتارلىق ئۈچىنچى تەرەپلەر بەلگىلەيدۇ.

source: The settings on your browser and computer are unique. Fingerprinters collect a variety of these unique settings to create a profile of you, which can be used to track you as you browse.
ug: تور كۆرگۈ ۋە كومپيۇتېرىڭىزدىكى تەڭشەكلەر بىردىنبىرلىككە ئىگە. بارماق ئىزى بۇ خىل ئۆزگىچە تەڭشەكلەرنى توپلاپ، تەرجىمىھالىڭىزنى ھاسىل قىلىدۇ ، بۇ توركۆرگۈدە سىزنى ئىز قوغلاشقا ئىشلىتىلىدۇ.

source: The theme will automatically change based on your display brightness. You can set the threshold where the theme changes. The circle indicates your display’s current brightness.
ug: ئۆرنەك ئېكران يورۇقلۇقىغا ئاساسەن ئۆزلۈكىدىن ئۆزگەرتىدۇ. سىز ئۆرنەكنى ئۆزگەرتىپ بوسۇغا قىممەتنى تەڭشىيەلەيسىز. چەمبەر ئېكرانىڭىزنىڭ ھازىرقى يورۇقلۇق دەرىجىسىنى ئىپادىلەيدۇ.

source: This action will clear all of your private data, including history from your synced devices.
ug: بۇ ھەرىكەت بارلىق شەخسىي ئۇچۇرلىرىڭىزنى تازىلايدۇ، ماس قەدەملىك ئۈسكۈنىلىرىڭىزدىكى تارىخ خاتىرىسىمۇ شۇنىڭ ئىچىدە.

source: This action will clear all of your private data. It cannot be undone.
ug: بۇ ھەرىكەت شەخسىي ئۇچۇرلىرىڭىزنىڭ ھەممىسىنى تازىلايدۇ. ئۇنى ئەمەلدىن قالدۇرغىلى بولمايدۇ.

source: This action will clear all of your website data. It cannot be undone.
ug: بۇ مەشغۇلات تور بېكەت ئۇچۇرلىرىنىڭ ھەممىسىنى تازىلايدۇ. ئۇنى ئەمەلدىن قالدۇرغىلى بولمايدۇ.

source: This action will clear the selected items. It cannot be undone.
ug: بۇ مەشغۇلات تاللىغان تۈرنى تازىلايدۇ. ئۇنى ئەمەلدىن قالدۇرغىلى بولمايدۇ.

source: This allows you to save the image to your Camera Roll.
ug: بۇ ئارقىلىق سۈرەتنى كامېرا لىنتىسىغا ساقلىشىڭىزغا يول قويىدۇ.

source: This breach occurred on
ug: بۇ سىزما يۈز بەرگەن ۋاقىت

source: This Connection is Untrusted
ug: بۇ باغلىنىش ئىشەنچسىز

source: This device has been successfully disconnected from Firefox Sync.
ug: بۇ ئۈسكۈنە Firefox قەدەمداشتىن مۇۋەپپەقىيەتلىك ئۈزۈلدى.

source: This folder is empty
ug: بۇ قىسقۇچ بوش

source: This folder isn’t empty.
ug: بۇ قىسقۇچ بوش ئەمەس.

source: This lets you save photos.
ug: بۇ ئارقىلىق سۈرەتلەرنى ساقلىغىلى بولىدۇ.

source: This must be turned on to receive tabs and get notified when you sign in on another device.
ug: سىز باشقا ئۈسكۈنىدە تىزىمغا كىرگەندە بەتكۈچ تاپشۇرۇۋېلىش ۋە ئۇقتۇرۇش قىلىش چوقۇم ئوچۇق بولۇشى كېرەك.

source: This page appears to be in %1$@. Translate to %2$@ with %3$@?
ug: بۇ بەت %1$@ سۈپىتىدە كۆرۈنىدۇ. %3$@ دا %2$@ غا تەرجىمە قىلامدۇ؟

source: This site is asking to download a file and add an event to your calendar.
ug: بۇ تور بېكەت ھۆججەتتىن بىرنى چۈشۈرۈپ، بىر پائالىيەتنى يىلنامىڭىزگە قوشنى ئىلتىماس قىلدى.

source: this week
ug: بۇ ھەپتە

source: This will remove the card from all of your synced devices.
ug: بۇ مەشغۇلات قەدەمداشلانغان بارلىق ئۈسكۈنىلىرىڭىزدىن كارتىنى چىقىرىۋېتىدۇ.

source: This will remove the password from all of your synced devices.
ug: بۇ مەشغۇلات قەدەمداشلانغان بارلىق ئۈسكۈنىلىرىڭىزدىن پارولنى چىقىرىۋېتىدۇ.

source: Thought-Provoking Stories
ug: نادىر ھېكايە

source: Threshold
ug: بوسۇغا

source: %@ Tip
ug: %@ كۆرسەتمە

source: Tips and Features
ug: كۆرسەتمە ۋە ئىقتىدارلار

source: Title
ug: ماۋزۇ

source: Today and Yesterday
ug: بۈگۈن ۋە تۈنۈگۈن

source: today at %@
ug: بۈگۈن %@

source: Toolbar Settings
ug: قورال بالداق تەڭشىكى

source: Tools submenu
ug: قورال تارماق تىزىملىك

source: Top Sites
ug: دائىملىق بېكەتلەر

source: To save and autofill credit cards, enable Face ID, Touch ID, or a device passcode.
ug: ئىناۋەتلىك كارتىنى ساقلاش ۋە ئۆزلۈكىدىن تولدۇرۇش ئۈچۈن، چىراي كىملىكى، تېگىش كىملىكى ياكى ئۈسكۈنىنىڭ ئىم كودىنى قوزغىتىڭ.

source: To save and autofill logins and passwords, enable Face ID, Touch ID or a device passcode.
ug: ئۆزلۈكىدىن تولدۇرۇش ۋە ئىم ساقلاش ئۈچۈن چىراي كىملىكى، تېگىش كىملىكى ياكى ئۈسكۈنى ئىم كودىنى قوزغىتىڭ.

source: To save and automatically fill passwords, enable Face ID, Touch ID, or a device passcode.
ug: ئىمنى ئۆزلۈكىدىن تولدۇرۇش ۋە ساقلاش ئۈچۈن چىراي كىملىكى، تېگىش كىملىكى ياكى ئۈسكۈنە ئىم كودى قوزغىتىلىدۇ.

source: To use the AutoFill feature for Firefox, you must have a device passcode enabled.
ug: Firefox نىڭ ئۆزلۈكىدىن تولدۇرۇش ئىقتىدارىنى ئىشلىتىش ئۈچۈن، چوقۇم ئۈسكۈنىنىڭ ئىم كودىنى قوزغىتىشىڭىز كېرەك.

source: Townland
ug: بازار

source: Trackers blocked: %@
ug: ئىزلىغۇچى توسۇلدى: %@

source: Tracking content: %@
ug: ئىز قوغلاش مەزمۇنى: %@

source: Tracking Protection
ug: ئىزلاشتىن قوغداش

source: Troubleshoot
ug: كاشىلا ئوڭشاش

source: Try Review Checker
ug: باھالاش تەكشۈرگۈچنى سىناي

source: Try the new collection.
ug: يېڭى يىغقۇچنى سىناش.

source: Turn off Night Mode
ug: كېچىلىك ھالەتنى تاقا

source: Turn Off Review Checker
ug: باھالاش تەكشۈرگۈچنى تاقا

source: Turn off suggestions in private browsing
ug: شەخسىي زىيارەتتە تەكلىپلەرنى تاقايدۇ

source: Turn on AutoFill
ug: ئۆزلۈكىدىن تولدۇرنى ئاچ

source: Turn on Night Mode
ug: كېچىلىك ھالەتنى ئاچ

source: Turn on Notifications
ug: ئۇقتۇرۇشنى ئاچ

source: Turn On Notifications
ug: ئۇقتۇرۇشنى ئاچ

source: Turn on tab syncing to view a list of tabs from your other devices.
ug: باشقا ئۈسكۈنىلىرىڭىزدىكى بەتكۈچ تىزىمىنى كۆرۈش ئۈچۈن بەتكۈچ قەدەمداشنى ئېچىڭ.

source: Turns private mode on or off
ug: شەخسىي ھالەتنى ئاچىدۇ ياكى تاقايدۇ

source: Undo
ug: يېنىۋال

source: Unpin
ug: مىخلىما

source: unread
ug: ئوقۇلمىغان

source: Unselected
ug: تاللانمىدى

source: Unsorted Bookmarks
ug: رەتلەنمىگەن خەتكۈچ

source: Update card?
ug: كارتا يېڭىلامدۇ؟

source: Update login %1$@ for %2$@?
ug: %1$@ نىڭ %2$@ دىكى تىزىمغا كىرىش ئۇچۇرىنى يېڭىلامدۇ؟

source: Update login for %@?
ug: %@ نىڭ تىزىمغا كىرىش ئۇچۇرىنى يېڭىلامدۇ؟

source: Update this card?
ug: بۇ كارتىنى يېڭىلامدۇ؟

source: URL Copied To Clipboard
ug: تور ئادرېسى چاپلاش تاختىسىغا كۆچۈرۈلدى

source: URL (Replace Query with %s)
ug: تور ئادرېسى (سۈرۈشتۈرۈش %s غا ئالماشتۇرۇلىدۇ)

source: Use a saved address?
ug: ساقلانغان ئادرېسنى ئىشلىتەمدۇ؟

source: Use a saved card?
ug: ساقلانغان كارتىنى ئىشلىتەمدۇ؟

source: Use a strong password?
ug: كۈچلۈك ئىم ئىشلىتەمدۇ؟

source: Use Current Page
ug: نۆۋەتتىكى بەتنى ئىشلەت

source: Use Email Instead
ug: ئورنىغا ئېلخەت ئىشلىتىڭ

source: Use Password
ug: ئىم ئىشلەت

source: Use saved address
ug: ساقلانغان ئادرېسنى ئىشلىتىدۇ

source: Use saved password
ug: ساقلانغان ئىمنى ئىشلەت

source: Use saved password?
ug: ساقلانغان ئىمنى ئىشلىتەمدۇ؟

source: Use Siri shortcuts to quickly open Firefox via Siri
ug: Siri تېزلەتمىسىنى ئىشلىتىپ Siri ئارقىلىق Firefox نى تېز ئاچىدۇ

source: Use stage servers
ug: ئالدىن تارقىتىش مۇلازىمىتىنى ئىشلەت

source: Use System Light/Dark Mode
ug: سىستېما يورۇق/قاراڭغۇ ھالەتنى ئىشلىتىدۇ

source: Use your fingerprint to access Logins now.
ug: بارماق ئىزىڭىزنى ئىشلىتىپ تىزىمغا كىرىش ئۇچۇرىنى زىيارەت قىلىڭ.

source: Use your fingerprint to access passwords now.
ug: بارماق ئىزىڭىزنى ئىشلىتىپ ئىم ئۇچۇرىنى زىيارەت قىلىڭ.

source: Using the power of %1$@ by %2$@, we help you avoid biased and inauthentic reviews. Our AI model is always improving to protect you as you shop.
ug: %2$@ قوللايدىغان %1$@ بىر تەرەپلىمە ۋە ئىناۋەتسىز باھالاشلاردىن ساقلىنىشىڭىزغا ياردەم بېرىدۇ. بىزنىڭ سۈنئىي ئەقىل مودېلىمىز مال سېتىۋېلىشىڭىزنى قوغداش ئۈچۈن ھەمىشە ياخشىلىنىۋاتىدۇ.

source: Validity
ug: ئىناۋەتلىكى

source: Verified by %@
ug: دەلىللىگۈچى %@

source: Very dissatisfied
ug: بەك نارازى

source: Very satisfied
ug: بەك رازى

source: View address
ug: ئادرېس كۆرسەت

source: View Card
ug: كارتا كۆرسەت

source: View certificate
ug: گۇۋاھنامىنى كۆرسەت

source: View Inactive Tabs
ug: ئاكتىپسىز بەتكۈچنى كۆرسىتىدۇ

source: Village or Township
ug: يېزا ياكى بازار

source: Visit site anyway
ug: تور بېكەتنى داۋاملىق زىيارەت قىلىش

source: Wallpaper
ug: تام قەغىزى

source: Wallpaper Updated!
ug: تام قەغىزى يېڭىلاندى!

source: Warning: we can’t confirm your connection to this website is secure.
ug: ئاگاھلاندۇرۇش: بۇ توربېكەتكە ئۇلىنىشىڭىزنىڭ بىخەتەر ئىكەنلىكىنى جەزملەشتۈرەلمەيمىز.

source: We assign each product’s reviews a *letter grade* from A to F.
ug: بىز ھەر بىر مەھسۇلاتنىڭ باھالىنىشىغا A دىن F غىچە *ھەرپ دەرىجىسى* تەقسىملەيمىز.

source: Web content
ug: تور مەزمۇنى

source: We believe there’s a mix of reliable and unreliable reviews
ug: ئىشەنچلىك ۋە ئىشەنچسىز باھالارنىڭ بارلىقىغا ئىشىنىمىز

source: Website Breach
ug: تور بېكەت سىزمىسى

source: Website Data
ug: تور بېكەت سانلىق مەلۇماتى

source: Website Shortcuts
ug: تور بېكەت تېزلەتمىسى

source: Websites may load outside ads, videos, and other content that contains hidden trackers. Blocking this can make websites load faster, but some buttons, forms, and login fields, might not work.
ug: تور بېكەتلەر يوشۇرۇن ئىز قوغلىغۇچ بار ئېلان، سىن ۋە باشقا مەزمۇنلارنى يۈكلىشى مۇمكىن. بۇنى توسۇش تور بېكەتنىڭ يۈكلىنشىنى تېزلىتىدۇ ، ئەمما بەزى توپچە، كۆزنەك ۋە تىزىمغا كىرىش بۆلەكلىرى ئىشلىمەسلىكى مۇمكىن.

source: Websites you’ve visited recently will show up here.
ug: سىز يېقىندا زىيارەت قىلغان تور بېكەتلەر بۇ يەردە كۆرۈنىدۇ.

source: Websites you visit may request your location.
ug: سىز زىيارەت قىلغان تور بېكەتلەر ئورنىڭىزنى تەلەپ قىلىشى مۇمكىن.

source: Welcome to an independent internet
ug: مۇستەقىل ئىنتېرنېتقا خۇش كەلدىڭىز

source: Welcome to Firefox
ug: Firefox غا خۇش كەپسىز

source: Welcome to your Reading List
ug: ئوقۇش تىزىمىڭىزگە خۇش كەپسىز

source: Well, this is embarrassing.
ug: ئاپلا، ئادەمنى خىجىل قىلىپ.

source: We’re working to resolve this issue. Please check back soon.
ug: بىز بۇ مەسىلىنى ھەل قىلىش ئۈچۈن تىرىشىۋاتىمىز. پات پۇرسەتتە قايتا تەكشۈرۈپ بېقىڭ.

source: We use AI technology from %1$@ by %2$@ to check the reliability of product reviews. This will only help you assess review quality, not product quality.
ug: بىز %2$@ نىڭ %1$@ دىكى سۈنئىي ئەقىل تېخنىكىسىنى ئىشلىتىپ مەھسۇلات باھالىنىشىنىڭ ئىشەنچلىكلىكىنى تەكشۈردۇق. بۇ مەھسۇلات سۈپىتىنى ئەمەس، بەلكى باھالاش سۈپىتىنى باھالىشىڭىزغا ياردەم بېرىدۇ.

source: What’s New
ug: نېمە يېڭىلىق بار

source: When Leaving Private Browsing
ug: شەخسىي زىيارەت ھالىتىدىن ئايرىلغاندا

source: When long-pressing links
ug: ئۇلانمىنى ئۇزۇن باسقاندا

source: When Long-pressing Links
ug: ئۇلانمىنى ئۇزۇن باسقاندا

source: When opening %@
ug: %@ نى ئاچقاندا

source: When opening Firefox
ug: Firefox نى ئاچقاندا

source: When Opening Firefox
ug: Firefox نى ئاچقاندا

source: When you’re signed in and synced, you’re safer. %@ encrypts your passwords, bookmarks, and more.
ug: تىزىمغا كىرىپ قەدەمداشلىسىڭىز، تېخىمۇ بىخەتەر بولىسىز. %@ ئىم، خەتكۈچ ۋە باشقىلارنى مەخپىيلەشتۈرىدۇ.

source: Wikipedia
ug: ۋىكىپېدىيا

source: Window
ug: كۆزنەك

source: yesterday
ug: تۈنۈگۈن

source: Yes, Try It
ug: ھەئە، سىناپ باقاي

source: You are not signed in to your account.
ug: سىز تېخى ھېساباتىڭىزغا كىرمىدىڭىز.

source: You are not signed in to your Firefox Account.
ug: سىز تىخى Firefox ھېساباتىڭىزغا كىرمىدىڭىز.

source: You cannot undo this action.
ug: بۇ مەشغۇلاتتىن يېنىۋالالمايسىز.

source: You don’t have any other devices connected to this account available to sync.
ug: بۇ ھېساباتقا باغلانغان قەدەمداشلىنىدىغان باشقا ئۈسكۈنە يوق.

source: You don’t have any other devices connected to this Firefox Account available to sync.
ug: بۇ Firefox ھېساباتىغا باغلانغان قەدەمداشلىنىدىغان باشقا ئۈسكۈنە يوق.

source: You’ll sign into %@
ug: سىز %@ غا تىزىمغا كىرىسىز

source: Your connection is not secure.
ug: باغلىنىشىڭىز بىخەتەر ئەمەس.

source: You’re protected. If we spot something, we’ll let you know.
ug: قوغدالدىڭىز. ئەگەر بىرەر نەرسە بايقىساق، سىزگە بىلدۈرىمىز.

source: Your passwords are now protected by Face ID, Touch ID or a device passcode.
ug: پارولىڭىز ھازىر چىراي كىملىكى بىلەن قوغدالغان، كىملىكنى چېكىڭ ياكى ئۈسكۈنە ئىم كودىنى كىرگۈزۈڭ.

source: Your Rights
ug: ھوقۇقىڭىز

source: Your tabs from other devices show up here.
ug: باشقا ئۈسكۈنىلەردىن كەلگەن بەتكۈچلىرىڭىز بۇ يەردە كۆرۈنىدۇ.

source: You turned off all %1$@ notifications. Turn them on by going to device Settings > Notifications > %2$@
ug: سىز بارلىق %1$@ ئۇقتۇرۇشلىرىنى تاقىۋەتتىڭىز. ئۈسكۈنە تەڭشەك›ئۇقتۇرۇش›%2$@ دىن ئېچىڭ

source: You turned off protections
ug: قوغداشنى تاقىۋەتتىڭىز

source: ZIP Code
ug: پوچتا نومۇرى

source: Zoom
ug: يېقىنلاشتۇر

source: Zoom (%@)
ug: يېقىنلاشتۇر(%@)

source: Zoom In
ug: يېقىنلات

source: Zoom Out
ug: يىراقلات

source: 1 year plan including Relay Premium + Mozilla VPN for $MONTHLY_PRICE$/month.
ug: Relay Premium + Mozilla VPN نىڭ 1 يىللىق پىلانى $MONTHLY_PRICE$/ئاي.

source: Activate phone mask
ug: تېلېفون نىقابىنى قوزغات

source: Activate your phone mask
ug: تېلېفون نىقابىنى قوزغات

source: Add account name
ug: ھېسابات ئىسمى قوش

source: Additional email masks
ug: قوشۇمچە ئېلخەت نىقابى

source: Add Mozilla VPN at $SAVINGS$ off.
ug: $SAVINGS$ ئىتېبار بىلەن Mozilla VPN ئېرىشىڭ.

source: Add Mozilla VPN for $SAVINGS$ off.
ug: $SAVINGS$ ئېتىبار بىلەن Mozilla VPN ئېرىشىڭ.

source: All email masks
ug: بارلىق ئېلخەت نىقابى

source: Allow data collection
ug: سانلىق مەلۇمات توپلاشقا يول قويىدۇ

source: Allow Mozilla to collect information about how you use this extension.
ug: Mozilla نىڭ بۇ كېڭەيتمىنى قانداق ئىشلىتىدىغانلىقىڭىز ھەققىدە ئۇچۇر توپلىشىغا يول قويۇڭ.

source: Allow Mozilla to collect interaction data
ug: Mozilla نىڭ تەسىرلىشىش سانلىق مەلۇماتىنى توپلىشىغا يول قويىدۇ

source: All you need to do is make up and share a unique mask that uses your custom subdomain — the mask will be generated automatically. Try “shop@customsubdomain.mozmail.com” next time you shop online, for example.
ug: سىزنىڭ قىلىدىغىنىڭىز پەقەت ئۆزىڭىزنىڭ خاس تارماق ئاتىنى ئىشلىتىدىغان ئۆزگىچە نىقاب قۇرۇپ ھەمبەھىرلەش — نىقاب ئاپتوماتىك ھاسىل بولىدۇ. كېيىنكى قېتىم توردا مال سېتىۋالغىنىڭىزدا، مىسالەن: «shop@customsubdomain.mozmail.com» نى سىناپ بېقىڭ.

source: As a Relay Premium subscriber, you can get text messages and phone calls without revealing your real number. Start by selecting a number to use as your phone number mask. It only takes 5 minutes.
ug: Relay Premium مۇشتەرى بولۇش سۈپىتىڭىز بىلەن، ھەقىقىي نومۇرىڭىزنى ئاشكارىلىماي تۇرۇپ قىسقا ئۇچۇر يوللاپ ۋە تېلېفون ئۇرالايسىز. تېلېفون نومۇرى نىقابى سۈپىتىدە ئىشلىتىدىغان نومۇرنى تاللاڭ. بۇنىڭغا پەقەت 5 مىنۇت ۋاقىت كېتىدۇ.

source: Attachment size increase
ug: قوشۇمچە ھۆججەتنىڭ چوڭلۇقى ئارتتى

source: A worldwide protection tool
ug: دۇنيا مىقياسىدىكى قوغداش قورالى

source: Blocking
ug: توسۇۋاتىدۇ

source: Block promotional emails
ug: بازارچىلىق ئېلخەتنى توسسۇن

source: Calls and texts blocked
ug: توسۇلغان چاقىرىش ۋە تېكىست

source: Calls and texts forwarded
ug: ئۇلاپ يوللىغان چاقىرىش ۋە تېكىست

source: Character(s) not allowed: $CHARACTERS$
ug: قوللىمايدىغان ھەرپ: $CHARACTERS$

source: Click to copy
ug: چېكىلسە كۆچۈرىدۇ

source: Collecting interaction data when you do things like click the Relay icon in your toolbar or create a new mask helps us learn what is working well and where we can improve. You can always turn this off in the Settings panel.
ug: سىز قورال بالداقتىكى Relay سىنبەلگىسىنى چېكىش ياكى يېڭى بىر نىقاب قۇرۇش قاتارلىق مەشغۇلاتلارنى قىلغىنىڭىزدا، ئۆز-ئارا تەسىر سانلىق مەلۇماتلىرىنى توپلاش ئارقىلىق بىزنىڭ قايسى ئىقتىدارلارنىڭ ياخشى خىزمەت قىلىۋاتقانلىقىنى ۋە قەيەرنى تېخىمۇ ياخشىلاش كېرەكلىكىنى بىلىشىمىزگە ياردەم بېرەلەيسىز. بۇ ئىقتىدارنى تەڭشەك تاختىسىدىن خالىغان ۋاقىتتا تاقىۋېتەلەيسىز.

source: Copied!
ug: كۆچۈرۈلدى!

source: Create a new custom mask
ug: يېڭىدىن ئىختىيارى نىقاب قۇر

source: Critical email forwarding
ug: ھالقىلىق ئېلخەتنى ئۇلاپ يوللاش

source: Decline
ug: رەت قىل

source: Disable data collection
ug: سانلىق مەلۇمات توپلاشنى چەكلەيدۇ

source: e.g. “coffee”
ug: مەسىلەن «قەھۋە»

source: Email masks used
ug: ئىشلىتىلگەن ئېلخەت نىقابلىرى

source: Email mask was not accepted by website
ug: تور بېكەت ئېلخەت نىقابىنى قوللىمايدۇ

source: Emails blocked
ug: ئېلخەت توسۇلدى

source: Emails forwarded
ug: ئېلخەت ئۇلاپ يوللاندى

source: Email trackers removed
ug: ئېلخەت ئىزلىغۇچ چىقىرىۋېتىلدى

source: Enable Block Promotional Emails on a mask to stop marketing emails from reaching your inbox.
ug: نىقابلىق ئېلخەت ساندۇقىنىڭ «بازارچىلىق ئېلخەتنى توسۇش» ئىقتىدارىنى قوزغىتىپ، ئېلخەت ساندۇقىڭىزغا بازارچىلىق ئېلخەتلىرىنى ئۇلاپ يوللاشنى توختىتىدۇ.

source: Enable new features
ug: يېڭى ئىقتىدارنى قوزغات

source: Enter email mask prefix
ug: نىقابلىق ئېلخەت ئالدى قوشۇلغۇچىسى كىرگۈزۈلىدۇ

source: Firefox password manager + Relay
ug: Firefox پارول باشقۇرغۇچ + Relay

source: Firefox Relay can now forward emails up to 25MB, including attachments.
ug: ھازىر Firefox Relay ئەڭ چوڭ بولغاندا 25MB يۈكلەنمىنى ئۆز ئىچىگە ئالغان ئېلخەتنى ئۇلاپ يوللىيالايدۇ.

source: Firefox Relay helps you protect your true email address — the one most closely tied to your online identity. It lets you generate unique, random masks you can use to sign up for accounts, apps, or newsletters, and forwards messages to your true address. If you find that an account is sending unwanted email or spam, you can block the mask and it will stop sending email to your inbox. Once you no longer want an account, you can delete the mask.
ug: تور كىملىكىڭىزگە ئەڭ يېقىن - Firefox Relay سىزنىڭ ھەقىقىي ئېلخەت ئادرېسىڭىزنى قوغداشقا ياردەم بېرىدۇ. ئۇ سىزگە بىردىنبىر، تاسادىپىي نىقاب ھاسىل قىلىپ بىرىدۇ، سىز نىقابلىق ئېلخىتىڭىز ئارقىلىق ھېسابات تىزىملىتىپ، ئەپ، خەۋەر ۋە ئۇچۇرلارنى ھەقىقىي ئېلخەت ئادرېسىڭىزغا ئۇلاپ يوللىيالايسىز. ئەگەر كېرەكسىز ئېلخەت ياكى ئەخلەت خەت ئەۋەتىۋاتقانلىقىنى بايقىسىڭىز، نىقابنى چەكلەپ قويسىڭىزلا شۇ ھامان ھەقىقىي ئېلخەت ساندۇقىڭىزغا ئۇلاپ يوللاش توختايدۇ. مەلۇم بىر نىقابنىڭ لازىمى قالمىغاندا، نىقابنى ئۆچۈرەلەيسىز.

source: Firefox Relay makes it easy to create email masks that forward to your true inbox.
ug: Firefox Relay نىقابلىق ئېلخەت ساندۇقىنى ئاسانلا قۇرۇپ، تاپشۇرۇۋالغان ئېلخەت يوللانمىسىنى ئاپتوماتىك ھالدا سىزنىڭ ھەقىقىي ئېلخەت ساندۇقىڭىزغا يوللايدۇ.

source: Firefox Relay Premium is now available in your country. Protect your inbox with unlimited email masks, and get a unique Relay email domain to make creating masks on the go easy and secure.
ug: Firefox Relay Premium مۇلازىمىتىنى ھازىر دۆلىتىڭىزدىمۇ ئىشلىتىشكە بولىدۇ. بۇ مۇلازىمەتتىن پايدىلىنىپ، چەكلىمىسىز ئېلخەت نىقابى ئارقىلىق ئۆزىڭىزنىڭ ئېلخەت ساندۇقىڭىزنى قوغدىيالايسىز.

source: Forwarding
ug: ئۇلاپ يوللاۋاتىدۇ

source: Forward to:
ug: ئۇلاپ يوللا:

source: From this website
ug: بۇ تور بېكەتتىن

source: Generate custom mask
ug: ئىختىيارىي نىقاب ھاسىللاش

source: Generate mask
ug: نىقاب ھاسىللاش

source: Generate new mask
ug: يېڭى نىقاب ھاسىللاش

source: Generate new random mask
ug: يېڭى ئىختىيارىي نىقاب ھاسىللاش

source: Generate random mask
ug: ئىختىيارىي نىقاب ھاسىللاش

source: Get 1 year of Relay Premium
ug: Relay Premium غا 1 يىللىق مۇشتەرى بولۇش

source: Get 20% off Relay Premium
ug: Relay Premium غا %20 ئېتىبار باھادا ئېرىشىڭ

source: Get a unique Relay email domain
ug: بىردىنبىر Relay ئېلخەت دائىرىسىگە ئېرىشىڭ

source: Get a year of Relay Premium Phone Masking plus Mozilla VPN for $MONTHLY_PRICE$/month.
ug: بىر يىللىق Relay Premium تېلېفون نىقابى ۋە Mozilla VPN نى ئايلىقى $MONTHLY_PRICE$دىن زاكاس قىلىڭ.

source: Get more protection
ug: تېخىمۇ كۆپ قوغداشقا ئېرىشىڭ

source: Get phone masking
ug: تېلېفون نىقابىغا ئېرىشىش

source: Get Relay Premium
ug: Relay Premium غا ئېرىشىڭ

source: Get Relay Premium before September 27th and enjoy unlimited masking at our introductory month-to-month price.
ug: 9-ئاينىڭ 27-كۈنىدىن بۇرۇن Relay Premium نى زاكاز قىلسىڭىز، ئېتىبار باھادىن بەھرىمان بولالايسىز.

source: Get started by signing in to Relay with your account.
ug: ھېساباتىڭىز بىلەن Relay غا كىرىپ ئىشلىتىشنى باشلاڭ.
